xiongGithub1/autosarTc234/Applications/tc234Autosar/MCAL/general/tricore/inc/TC23x/IfxCbs_bf.h
/** \brief  Mask for Ifx_CBS_TRC_Bits.BRKOUT */
#define IFX_CBS_TRC_BRKOUT_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TRC_Bits.BRKOUT */
#define IFX_CBS_TRC_BRKOUT_OFF (4u)

/** \brief  Length for Ifx_CBS_TRC_Bits.BT1 */
#define IFX_CBS_TRC_BT1_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRC_Bits.BT1 */
#define IFX_CBS_TRC_BT1_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRC_Bits.BT1 */
#define IFX_CBS_TRC_BT1_OFF (8u)

/** \brief  Length for Ifx_CBS_TRC_Bits.HALT */
#define IFX_CBS_TRC_HALT_LEN (4u)

/** \brief  Mask for Ifx_CBS_TRC_Bits.HALT */
#define IFX_CBS_TRC_HALT_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TRC_Bits.HALT */
#define IFX_CBS_TRC_HALT_OFF (0u)

/** \brief  Length for Ifx_CBS_TRC_Bits.SUSIN */
#define IFX_CBS_TRC_SUSIN_LEN (4u)

/** \brief  Mask for Ifx_CBS_TRC_Bits.SUSIN */
#define IFX_CBS_TRC_SUSIN_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TRC_Bits.SUSIN */
#define IFX_CBS_TRC_SUSIN_OFF (24u)

/** \brief  Length for Ifx_CBS_TREC_Bits.TR0EV */
#define IFX_CBS_TREC_TR0EV_LEN (4u)

/** \brief  Mask for Ifx_CBS_TREC_Bits.TR0EV */
#define IFX_CBS_TREC_TR0EV_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TREC_Bits.TR0EV */
#define IFX_CBS_TREC_TR0EV_OFF (0u)

/** \brief  Length for Ifx_CBS_TREC_Bits.TR2EV */
#define IFX_CBS_TREC_TR2EV_LEN (4u)

/** \brief  Mask for Ifx_CBS_TREC_Bits.TR2EV */
#define IFX_CBS_TREC_TR2EV_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TREC_Bits.TR2EV */
#define IFX_CBS_TREC_TR2EV_OFF (8u)

/** \brief  Length for Ifx_CBS_TREC_Bits.TR4EV */
#define IFX_CBS_TREC_TR4EV_LEN (4u)

/** \brief  Mask for Ifx_CBS_TREC_Bits.TR4EV */
#define IFX_CBS_TREC_TR4EV_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TREC_Bits.TR4EV */
#define IFX_CBS_TREC_TR4EV_OFF (16u)

/** \brief  Length for Ifx_CBS_TREC_Bits.TR6EV */
#define IFX_CBS_TREC_TR6EV_LEN (4u)

/** \brief  Mask for Ifx_CBS_TREC_Bits.TR6EV */
#define IFX_CBS_TREC_TR6EV_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TREC_Bits.TR6EV */
#define IFX_CBS_TREC_TR6EV_OFF (24u)

/** \brief  Length for Ifx_CBS_TRHSM_Bits.BRKIN */
#define IFX_CBS_TRHSM_BRKIN_LEN (4u)

/** \brief  Mask for Ifx_CBS_TRHSM_Bits.BRKIN */
#define IFX_CBS_TRHSM_BRKIN_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TRHSM_Bits.BRKIN */
#define IFX_CBS_TRHSM_BRKIN_OFF (20u)

/** \brief  Length for Ifx_CBS_TRHSM_Bits.BRKOUT */
#define IFX_CBS_TRHSM_BRKOUT_LEN (4u)

/** \brief  Mask for Ifx_CBS_TRHSM_Bits.BRKOUT */
#define IFX_CBS_TRHSM_BRKOUT_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TRHSM_Bits.BRKOUT */
#define IFX_CBS_TRHSM_BRKOUT_OFF (4u)

/** \brief  Length for Ifx_CBS_TRHSM_Bits.BT1 */
#define IFX_CBS_TRHSM_BT1_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRHSM_Bits.BT1 */
#define IFX_CBS_TRHSM_BT1_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRHSM_Bits.BT1 */
#define IFX_CBS_TRHSM_BT1_OFF (8u)

/** \brief  Length for Ifx_CBS_TRHSM_Bits.HALT */
#define IFX_CBS_TRHSM_HALT_LEN (4u)

/** \brief  Mask for Ifx_CBS_TRHSM_Bits.HALT */
#define IFX_CBS_TRHSM_HALT_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TRHSM_Bits.HALT */
#define IFX_CBS_TRHSM_HALT_OFF (0u)

/** \brief  Length for Ifx_CBS_TRHSM_Bits.SUSIN */
#define IFX_CBS_TRHSM_SUSIN_LEN (4u)

/** \brief  Mask for Ifx_CBS_TRHSM_Bits.SUSIN */
#define IFX_CBS_TRHSM_SUSIN_MSK (0xfu)

/** \brief  Offset for Ifx_CBS_TRHSM_Bits.SUSIN */
#define IFX_CBS_TRHSM_SUSIN_OFF (24u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_0 */
#define IFX_CBS_TRIG_TRGX_0_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_0 */
#define IFX_CBS_TRIG_TRGX_0_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_0 */
#define IFX_CBS_TRIG_TRGX_0_OFF (0u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_10 */
#define IFX_CBS_TRIG_TRGX_10_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_10 */
#define IFX_CBS_TRIG_TRGX_10_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_10 */
#define IFX_CBS_TRIG_TRGX_10_OFF (10u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_11 */
#define IFX_CBS_TRIG_TRGX_11_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_11 */
#define IFX_CBS_TRIG_TRGX_11_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_11 */
#define IFX_CBS_TRIG_TRGX_11_OFF (11u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_12 */
#define IFX_CBS_TRIG_TRGX_12_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_12 */
#define IFX_CBS_TRIG_TRGX_12_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_12 */
#define IFX_CBS_TRIG_TRGX_12_OFF (12u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_13 */
#define IFX_CBS_TRIG_TRGX_13_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_13 */
#define IFX_CBS_TRIG_TRGX_13_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_13 */
#define IFX_CBS_TRIG_TRGX_13_OFF (13u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_14 */
#define IFX_CBS_TRIG_TRGX_14_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_14 */
#define IFX_CBS_TRIG_TRGX_14_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_14 */
#define IFX_CBS_TRIG_TRGX_14_OFF (14u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_15 */
#define IFX_CBS_TRIG_TRGX_15_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_15 */
#define IFX_CBS_TRIG_TRGX_15_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_15 */
#define IFX_CBS_TRIG_TRGX_15_OFF (15u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_1 */
#define IFX_CBS_TRIG_TRGX_1_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_1 */
#define IFX_CBS_TRIG_TRGX_1_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_1 */
#define IFX_CBS_TRIG_TRGX_1_OFF (1u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_2 */
#define IFX_CBS_TRIG_TRGX_2_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_2 */
#define IFX_CBS_TRIG_TRGX_2_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_2 */
#define IFX_CBS_TRIG_TRGX_2_OFF (2u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_3 */
#define IFX_CBS_TRIG_TRGX_3_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_3 */
#define IFX_CBS_TRIG_TRGX_3_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_3 */
#define IFX_CBS_TRIG_TRGX_3_OFF (3u)

/** \brief  Length for Ifx_CBS_TRIG_Bits.TRGx_4 */
#define IFX_CBS_TRIG_TRGX_4_LEN (1u)

/** \brief  Mask for Ifx_CBS_TRIG_Bits.TRGx_4 */
#define IFX_CBS_TRIG_TRGX_4_MSK (0x1u)

/** \brief  Offset for Ifx_CBS_TRIG_Bits.TRGx_4 */
#define IFX_CBS_TRIG_TRGX_4_OFF (4u)

